// 4、导入数据（后期演练的时候使用这个演示的数据）
//      第一步：登录mysql数据库管理系统
//          dos命令窗口：
//              mysql -uroot -padmin123
//      第二步：查看有哪些数据库
//          show databases;（这个不是SQL语句，属于MySQL的命令。）
//          +--------------------+
//          | Database           |
//          +--------------------+
//          | information_schema |
//          | my_db_01           |
//          | mysql              |
//          | performance_schema |
//          | sakila             |
//          | sys                |
//          | world              |
//          +--------------------+
//      第三步：创建属于自己的数据库
//          create database xxx;（这个不是SQL语句，属于MySQL的命令。）
//      第四步：使用哪个xxx数据
//          use xxx;（这个不是SQL语句，属于MySQL的命令。）
//      第五步：查看当前使用的数据库中有哪些表？
//          show tables;（这个不是SQL语句，属于MySQL的命令。）
//      第六步：初始化数据
//          source '文件.sql'
//          
//          查看表：show tables;
//          +--------------------+
//          | Tables_in_my_db_01 |
//          +--------------------+
//          | dept               |
//          | emp                |
//          | salgrade           |
//          +--------------------+

// ---------------------------------------------------------------------------------------------------------------------------

// 5、xxx.sql，这个文件以sql结尾，这样的文件被称为“sql脚本”。什么是sql脚本？
//    当一个文件的扩展名是.sql，并且该文件中编写了大量的sql语句，我们称之为sql脚本。
//    注意：直接使用source命令可以执行sql脚本。
//    sql脚本中的数据量太大的时候，无法打开，请使用source命令完成初始化。

// ---------------------------------------------------------------------------------------------------------------------------

// 6、删除数据库：drop database xxx;

// ---------------------------------------------------------------------------------------------------------------------------

// 7、查看表结构：
//    desc dept;
//    +--------+-------------+------+-----+---------+-------+
//    | Field  | Type        | Null | Key | Default | Extra |
//    +--------+-------------+------+-----+---------+-------+
//    | DEPTNO | int         | NO   | PRI | NULL    |       |       部门编号
//    | DNAME  | varchar(14) | YES  | UNI | NULL    |       |       部门名称
//    | LOC    | varchar(13) | YES  |     | NULL    |       |       部门位置
//    +--------+-------------+------+-----+---------+-------+

//    desc emp;
//    +----------+-------------+------+-----+---------+----------------+
//    | Field    | Type        | Null | Key | Default | Extra          |
//    +----------+-------------+------+-----+---------+----------------+
//    | EMPNO    | int         | NO   | PRI | NULL    | auto_increment |        员工编号
//    | ENAME    | varchar(10) | YES  |     | NULL    |                |        员工姓名
//    | JOB      | varchar(9)  | YES  |     | NULL    |                |        工作岗位
//    | MGR      | int         | YES  |     | NULL    |                |        上级领导编号
//    | HIREDATE | date        | YES  |     | NULL    |                |        入职如期
//    | SAL      | double(7,2) | YES  |     | NULL    |                |        薪资
//    | COMM     | double(7,2) | YES  |     | NULL    |                |        补助/津贴
//    | DEPTNO   | int         | YES  |     | NULL    |                |        部门编号
//    +----------+-------------+------+-----+---------+----------------+

//    desc salgrade;
//    +-------+------+------+-----+---------+-------+
//    | Field | Type | Null | Key | Default | Extra |
//    +-------+------+------+-----+---------+-------+
//    | GRADE | int  | YES  |     | NULL    |       |       等级
//    | LOSAL | int  | YES  |     | NULL    |       |       最低薪资
//    | HISAL | int  | YES  |     | NULL    |       |       最高薪资
//    +-------+------+------+-----+---------+-------+

// ---------------------------------------------------------------------------------------------------------------------------

// 8、表中的数据
//    select * from dept;
//    +--------+----------+------+
//    | DEPTNO | DNAME    | LOC  |
//    +--------+----------+------+
//    |      1 | 行政部门 | A区  |
//    |      2 | 财务部门 | B区  |
//    |      3 | 研发中心 | C区  |
//    |      4 | 总经办   | D区  |
//    +--------+----------+------+

//    select * from emp;
//    +-------+-------+--------------+------+------------+----------+--------+--------+
//    | EMPNO | ENAME | JOB          | MGR  | HIREDATE   | SAL      | COMM   | DEPTNO |
//    +-------+-------+--------------+------+------------+----------+--------+--------+
//    |     1 | 张三  | 人事行政主管 |    5 | 2022-01-01 | 10000.00 | 300.00 |      1 |
//    |     2 | 李四  | 财务主管     |    5 | 2021-10-10 |  9500.00 | 200.00 |      2 |
//    |     3 | 王五  | 技术总监     |    5 | 2021-05-06 | 20000.00 | 500.00 |      3 |
//    |     4 | 赵六  | Java工程师   |    3 | 2022-02-02 | 12000.00 | 300.00 |      3 |
//    |     5 | 吴林  | 总经理       | NULL | 2020-10-01 | 30000.00 | 600.00 |      4 |
//    +-------+-------+--------------+------+------------+----------+--------+--------+

//    select * from salgrade;
//    +-------+-------+-------+
//    | GRADE | LOSAL | HISAL |
//    +-------+-------+-------+
//    |     1 |  5000 | 10000 |
//    |     2 | 10001 | 15000 |
//    |     3 | 15001 | 20000 |
//    |     4 | 20001 | 30000 |
//    +-------+-------+-------+

// ---------------------------------------------------------------------------------------------------------------------------

// 9、常用命令
//    查看当前使用测哪个数据库
//    select database();
//    +------------+
//    | database() |
//    +------------+
//    | my_db_01   |
//    +------------+

//    查看数据库版本
//    select version();
//    +-----------+
//    | version() |
//    +-----------+
//    | 8.0.28    |
//    +-----------+

// ---------------------------------------------------------------------------------------------------------------------------

// 10、查看创建表的语句
//     show create table emp;